Revit 2024 API
ParameterTypeId.MaterialAssetParamAssetLibId Property
 "Asset library id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId MaterialAssetParamAssetLibId { get; }
Visual Basic
Public Shared ReadOnly Property MaterialAssetParamAssetLibId As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ MaterialAssetParamAssetLibId {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace